---
kind: property
id: P:Autodesk.Revit.DB.FilterStringRule.RuleString
source: html/00e9b7aa-61b7-ba3a-74ff-d430630566b7.htm
---
# Autodesk.Revit.DB.FilterStringRule.RuleString Property

The user-supplied string against which strings from a Revit document will be tested.

## Syntax (C#)
```csharp
public string RuleString { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null